<template>
  <div class="w-full" id="terms">
    <div class="w-full text-center mt-5">
      <h1 class="text-2xl tracking-tight text-gray-900 sm:text-2xl md:text-3xl px-2 pt-3">
        <span class="block text-gray-600 xl:inline font-extrabold">條款與細則</span>
      </h1>
    </div>

    <div class="mt-10 px-5 sm:px-10 md:px-20">
      <div class="mb-10" v-for="item in termsList" :key="item.id">
        <strong class="text-xl">{{item.title}}</strong>
        <ul class="list-none mt-2">
          <li class="leading-7 text-sm" v-for="items in item.list" :key="items.id">{{items.text}}</li>
        </ul>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      termsList: [
        {
          id: 1,
          title: "免責聲明",
          list: [
            {
              id: 1,
              text:
                "當您進入本網站及瀏覽各網頁或成為本網站會員時，即表示您已詳讀並同意遵守「免責聲明」之所有內容。",
            },
            {
              id: 2,
              text:
                "如不接受本聲明，請立即停止使用本網站，否則將視為同意並接受本網站聲明。",
            },
            { id: 3, text: "下列情況發生時本網站不須負擔任何責任：" },
            {
              id: 4,
              text:
                "本網站服務之風險會由您個人承擔，同意使用本網站各項服務基於個人意願並同意自負任何風險，包括因為自本網站下載資料或圖片，或是自本網站服務中獲得之資料導致發生任何資源流失等結果。",
            },
            {
              id: 5,
              text:
                "在本網站填寫的物件資料、個人資料、上傳圖片等行為，純屬您個人行為，本網站對其內容之真實性或完整性不負任何責任。",
            },
            {
              id: 6,
              text:
                "任何由於電腦病毒侵入或發作、因政府管制而造成暫時性關閉等影響網路正常經營之不可抗力而造成的資料毀損、丟失、被盜與用或被竄改等與本網站無關。",
            },
            {
              id: 7,
              text:
                "本網站就各項服務不負任何明示或默示之擔保責任，本網站不保證各項服務之穩定、安全、無誤及不中斷；會員明示承擔使用本網站服務之所有風險極可能發生之任何損害。",
            },
            {
              id: 8,
              text:
                "維持更新您個人會員資料，確保為最新、正確、完整，若您提供任何錯誤、不實或不完整的資料，本網站有權暫停或終止您的帳號，並拒絕您使用本服務之全部或部分功能。",
            },
            {
              id: 9,
              text:
                "對於您透過本網站官網刊登或發布虛假、違法資訊、侵害他人權益及欺騙、敲詐行為者，純屬您個人行為，本網站官網對此而產生的一切糾紛不負任何責任。",
            },
            { id: 10, text: "特此聲明" },
          ],
        },
        {
          id: 2,
          title: "服務條款",
          list: [
            {
              id: 1,
              text:
                "當您成為本網站的會員時，即表示您已詳細閱讀、明確瞭解並同意接受本服務條款之所有內容。",
            },
            {
              id: 2,
              text:
                "此外，當您使用本網站的特定服務時，可能會依據該特定服務之性質，而須遵守本網站所另行公告之服務條款或相關規定。",
            },
            {
              id: 3,
              text:
                "若您為未滿二十歲，應於您的家長（或監護人）閱讀、瞭解並同意本服務條款之所有內容，方得使用本服務。",
            },
            {
              id: 4,
              text:
                "當您使用或繼續使用本服務時，即推定您的家長（或監護人）已閱讀、瞭解並同意接受本服務條款之所有內容及其後修改變更。",
            },
          ],
        },
        {
          id: 3,
          title: "權利所有權",
          list: [
            {
              id: 1,
              text:
                "本網站相關網站上刊載之所有內容及所有權利，包括版權歸以肌之名工作室所有，或由其授權。除著作權法規定不得為著作權之標的（請參考著作權法第9條規定）外，其他包括文字敘述、攝影、圖片、錄音、影像及其他資訊，均受著作權法保護。",
            },
            {
              id: 2,
              text:
                "本網站所有資訊內容受著作權法保護者，除著作權法規範之『合理範圍內』，皆應取得該著作財產權人同意或授權後，方得利用。",
            },
            {
              id: 3,
              text:
                "報導、評論、教學、研究或其他正當目的，在合理範圍內，得重製、公開播送或公開傳輸，利用時，得引用本行網站上之資訊，引用時，請註明出處。",
            },
            {
              id: 4,
              text:
                "其他『合理範圍內』使用情形，請參考著作權法第四十四條至第六十五條之規定。",
            },
          ],
        },
        {
          id: 4,
          title: "智慧財產權",
          list: [
            {
              id: 1,
              text: "TAG SKIN為中華民國註冊商標。",
            },
            {
              id: 2,
              text:
                "TAG SKIN及本網站於所屬之官方網站、Facebook、Instagram (...等網站 )內，所發佈上載之商標、商品、商品上之創作圖像，依據智慧財產權及著作權保護法，不可複製、重製、改作、變更、發行、播送、轉賣、散布、表演、展覽或利用前述網站上一部或全部內容及服務以賺取利益。",
            },
            {
              id: 3,
              text: "TAG SKIN及本網站一切權利主張已委任台一律師事務所。",
            },
          ],
        },
        {
          id: 5,
          title: "商品準確性",
          list: [
            {
              id: 1,
              text:
                "本網站產品的定價及商品狀態均已在本網站中的每個網頁上加以註明，本網站將有權隨時更改並且不會發任何通知(我們會盡量保證訊息的準確性)，如果發生意外狀況，在確認訂單後商品發生價格變化，本網站將以電子郵件或電話通知，在沒有取消訂單之情況，由您決定是否取消訂單。",
            },
            {
              id: 2,
              text:
                "商品所有價格均為稅前價格，不含運費。所有價格是訂購的商品加上適當的銷售稅，不包含本網站交付選項所列之運送費用。",
            },
            {
              id: 3,
              text:
                "產品與包裝可能因電子設備所顯示的不同(包含電腦與手機)，因此無法保證您所使用的設備能將任何顏色準確顯示呈現於所交付的商品上，商品重量及商品尺寸僅為接近值，我們會盡全力並準確將產品與其包裝的原色顯示於網站中，故本網站不負任何明示或默示之擔保責任保證。",
            },
            {
              id: 4,
              text:
                "我們對任何透由外部連結至本網站的任何其他網站的內容概不負責。本網站上出現的連結僅供您方便，並不代表我們與其內容、產品、服務與供應商相關。",
            },
            {
              id: 5,
              text:
                "使用本網站上任何資源，或是站外任何資訊，皆可能引起的無法預期的損失或損害，我們概不為此負責。",
            },
          ],
        },
        {
          id: 6,
          title: "運送條款",
          list: [
            {
              id: 1,
              text:
                "我們將依據您選擇的送貨選項進行配送，特別提醒：工作日僅為週一至週五，不包含星期六、星期日與例假日(配送時間將依照該物流公司當區送貨時間為主)。",
            },
            {
              id: 2,
              text:
                "一個配送地址只會收取一次運費，如需分別送至不同指定地則需另收費用。",
            },
            {
              id: 3,
              text:
                "如配送投遞不成功被物流退回，需重新投遞配送，將需由您本人再次支付運送費用。",
            },
          ],
        },
        {
          id: 7,
          title: "保護政策",
          list: [
            {
              id: 1,
              text:
                "本網站保留更改本聲明各項內容之權利，將於本網站同一位置公告更改聲明外，不另對會員進行個別通知，請定期查閱。",
            },
            {
              id: 2,
              text:
                "若您對本保護政策有任何問題或不同意該等變更或修改，可利用電子郵件(tagskintw@gmail.com)直接與本公司聯繫或停止繼續使用本網站服務。",
            },
          ],
        },
        {
          id: 8,
          title: "隱私權政策",
          list: [
            {
              id: 1,
              text:
                "針對消費者與個人資料之蒐集和運用，依中華民國「個人資料保護法」及本隱私權保護聲明，本網站已加強相關之保護措施。",
            },
            {
              id: 2,
              text:
                "※鄭重提醒您：請勿在網路上公開透露您個人資料，因該資料有可能會被他人蒐集和使用。",
            },
            {
              id: 3,
              text:
                "個人資料蒐集及使用，當您在註冊並購買商品時所留下的任何個人訊息，我們皆以極謹慎和安全的技術方式保護。",
            },
            {
              id: 4,
              text: "當您瀏覽本網站相關網站時，不會主動要求您輸入個人資料。",
            },
            {
              id: 5,
              text:
                "當您完成購物流程或參加其他活動時，本網站會要求您登錄個人資料，為確保是為您本人，並以便完成交易與相關服務。",
            },
            {
              id: 6,
              text:
                "本網站及其相關網站所取得的個人資料，都僅供本網站內部依照原說明的使用目的和範圍。",
            },
            {
              id: 7,
              text:
                "除事先說明或依相關法律規定外，本網站不會擅自將您的個人資料提供給第三人或作為其他目的之用。 ",
            },
            {
              id: 8,
              text:
                "本網站會自動記錄您在網站內的瀏覽，這些資料僅作為流量分析和網路行為調查，便於改善網站服務品質。",
            },
            {
              id: 9,
              text:
                "如果本網站涉及合併、收購等事宜，我們將繼續嚴守任何個人資料之保密，並於個人資料移轉或應適用不同隱私權政策前，先行通知受影響的使用者。",
            },
          ],
        },
        {
          id: 9,
          title: "Cookie",
          list: [
            {
              id: 1,
              text:
                "為提供您最佳的網路服務環境，本網站會在您的電子設備中設定存取Cookie，如電腦、手機等電子設備，若您不願接受Cookie的寫入，可以透過設定您的電子使用裝置，即可拒絕Cookie的寫入，但可能會導致本網站的部分功能無法正常執行與操作。",
            },
          ],
        },
        {
          id: 10,
          title: "隱私權政策",
          list: [
            {
              id: 1,
              text:
                "本網站不會以電話主動要求您至「ATM自動櫃員機操作」、「補繳金額」、「變更付款方式」、「提供刷卡資訊」等，亦不會要求提供信用卡背面的客服電話，接獲帶+號的電話請更要務必小心；若接到假冒客服或是銀行人員電話以 (訂單金額分期付款/扣款失敗/更改結帳方式/超商條碼異常)等名義，請您提供帳戶、信用卡資料或操作ATM轉帳匯款，以上皆為現在流行的詐騙手法，請小心勿受騙上當，切記提高警覺冷靜查詢，煩請透過多方聯繫管道： 客服信箱(tagskintw@gmail.com)、 訂單問答諮詢確認，並撥打165反詐騙專線查證，以確保安全，謝謝您。",
            },
          ],
        },
      ],
    };
  },
};
</script>